package com.epam.module01.main;
//6. Написать код для решения задачи. В n малых бидонах 80 л молока. Сколько
// литров молока в m больших бидонах, если в каждом большом бидоне на 12 л больше,
// чем в малом?
public class Main6 {
	
	public static void main(String[] args) {
			
			int n, m;
			
			n = 80;
			m = n + 12;
			
			System.out.print("В большом бидоне " + m + " л молока. ");
			
			
		}
		
		
	}

