package com.epam.module01.main;
//Дан прямоугольник, ширина которого в 2 раза меньше длины.Найти площадь
//прямоугольника.
public class Main7 {

	public static void main(String[] args) {
		
		double a, b, s;
		
		a = 5;
		b = 10;
		
		s = a * b;
		
		System.out.print("Площадь прямоугольника равна s = " + s);
		
		
		
		
	}
}
